Личный_помощник/src/Catalogs/ЕдиницыИзмерения/ЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЕдиницыИзмерения</name>
  <attributes>
    <name>УсловноеОбозначениеНациональное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловноеОбозначениеМеждународное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодовоеСимвольноеОбозначениеНациональное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодовоеСимвольноеОбозначениеМеждународное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Личный_помощник/src/Catalogs/ЕдиницыИзмерения/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьДаннымиИзМакета()Экспорт
	
	Макет = Справочники.ЕдиницыИзмерения.ПолучитьМакет("КлассификаторОКЕИ_КоммунальныеУслуги");
	КолонкиМакета = СтруктураСоответствияКолонокМакетаРеквизитам();
	НомерСтроки = 2;
	Пока Истина Цикл
		
		Код = Макет.Область("R" + НомерСтроки + "C1").Текст;
		Если Не ЗначениеЗаполнено(Код) Тогда
			Прервать;	
		КонецЕсли;
		
		ЭлементСправочника = Справочники.ЕдиницыИзмерения.НайтиПоКоду(Код, Истина);
		Если Не ЗначениеЗаполнено(ЭлементСправочника) Тогда
			ОбъектСправочника = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
			ОбъектСправочника.Код = Код;
		Иначе
			ОбъектСправочника = ЭлементСправочника.ПолучитьОбъект();
		КонецЕсли;
		
		Для Каждого КолонкаМакета Из КолонкиМакета Цикл
			ОбъектСправочника[КолонкаМакета.Ключ] = Макет.Область("R" + НомерСтроки + КолонкаМакета.Значение).Текст;	
		КонецЦикла;
		
		ОбъектСправочника.Записать();
		
		НомерСтроки = НомерСтроки + 1;
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеМетоды

Функция СтруктураСоответствияКолонокМакетаРеквизитам()
	
	Результат = Новый Структура;
	Результат.Вставить("Наименование", "C2");
	Результат.Вставить("УсловноеОбозначениеНациональное", "C3");
	Результат.Вставить("УсловноеОбозначениеМеждународное", "C4");
	Результат.Вставить("КодовоеСимвольноеОбозначениеНациональное", "C5");
	Результат.Вставить("КодовоеСимвольноеОбозначениеМеждународное", "C6");
	Возврат Результат;
	
КонецФункции


#КонецОбласти
